Xml/PCRF_freeIP_Z.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cai3="http://schemas.ericsson.com/cai3g1.2/" xmlns:sapc="http://schemas.ericsson.com/ma/SAPC/" >
    <soapenv:Header>
        <cai3:SessionId>55239393ba8e4f99a0b798bcd2df22f8</cai3:SessionId>
    </soapenv:Header>
    <soapenv:Body>
        <cai3:Set>
            <cai3:MOType>SAPCSubscription@http://schemas.ericsson.com/ma/SAPC/</cai3:MOType>
            <cai3:MOId>
                <sapc:pcSubscriberId >84888636368</sapc:pcSubscriberId>
            </cai3:MOId>
            <cai3:MOAttributes>
                <sapc:SetSAPCSubscription pcSubscriberId="84888636368">
                    <sapc:pcGroup pcGroupId="Zalo">
                        <sapc:pcGroupId>Zalo</sapc:pcGroupId>
                        <sapc:pcGroupStartDate>07-07-2025T10:32</sapc:pcGroupStartDate>
                        <sapc:pcGroupEndDate>07-07-2025T10:32</sapc:pcGroupEndDate>
                    </sapc:pcGroup>
                    <sapc:pcGroup pcGroupId="VNEDu">
                        <sapc:pcGroupId>VNEDu</sapc:pcGroupId>
                        <sapc:pcGroupStartDate>07-07-2025T10:32</sapc:pcGroupStartDate>
                        <sapc:pcGroupEndDate>07-07-2025T10:32</sapc:pcGroupEndDate>
                    </sapc:pcGroup>
                </sapc:SetSAPCSubscription>
            </cai3:MOAttributes>
        </cai3:Set>
    </soapenv:Body>
</soapenv:Envelope>
