create_ims_subscriber.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cai3="http://schemas.ericsson.com/cai3g1.2/">
    <soapenv:Header>
        <cai3:SequenceId>{0}</cai3:SequenceId>
        <cai3:TransactionId>{1}</cai3:TransactionId>
        <cai3:SessionId>{2}</cai3:SessionId>
    </soapenv:Header>
    <soapenv:Body>
        <cai3:Create>
            <cai3:MOType>IMSSubscription@http://schemas.ericsson.com/ema/UserProvisioning/IMS/5.0/</cai3:MOType>
            <cai3:MOId>
                <subscriberId>{3}</subscriberId>
            </cai3:MOId>
            <cai3:MOAttributes>
                <createIMSSubscription subscriberId="{3}" xsi:schemaLocation="http://schemas.ericsson.com/ema/UserProvisioning/IMS/5.0/ ema_UserProvisioning_IMS_5.0_.xsd" xmlns="http://schemas.ericsson.com/ema/UserProvisioning/IMS/5.0/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                    <subscriberId>{3}</subscriberId>
                    <pubData publicIdValue="{5}">
                        <publicIdValue>{5}</publicIdValue>
                        <publicIdTelValue>{6}</publicIdTelValue>
                        <implicitRegSet>1</implicitRegSet>
                        <isDefault>TRUE</isDefault>
                        <phoneContext>{7}</phoneContext>
                        <wirelineAccessAllowed>ALLOWED_FROM_ANY_LOCATION</wirelineAccessAllowed>
                        <configuredServiceProfiles configuredServiceProfileId="siptrunk_term_invite_reg_retail">
                            <configuredServiceProfileId>siptrunk_term_invite_reg_retail</configuredServiceProfileId>
                        </configuredServiceProfiles>
                        <configuredServiceProfiles configuredServiceProfileId="siptrunk_orig_invite_reg_retail">
                            <configuredServiceProfileId>siptrunk_orig_invite_reg_retail</configuredServiceProfileId>
                        </configuredServiceProfiles>
                    </pubData>
                    <privateUser privateUserId="{8}">
                        <privateUserId>{8}</privateUserId>
                        <userPassword>2222</userPassword>
                        <userMsisdn msisdn="{4}">
                            <msisdn>{4}</msisdn>
                        </userMsisdn>
                    </privateUser>
                </createIMSSubscription>
            </cai3:MOAttributes>
        </cai3:Create>
    </soapenv:Body>
</soapenv:Envelope>
